project/app/Http/Resources/GeneralSettingResource.php

select * from `generalsettings` limit 1
update `generalsettings` set `reward_amount_for_point` = '10' where `id` = 1
---
    public function update($input)
    {

        $gs = Generalsetting::first();
        $images = ['header_logo','favicon'];
        foreach($images as $image){
            if(isset($input[$image])){
               $input[$image] = MediaHelper::handleUpdateImage($input[$image],$gs[$image]);
            }
        }


        if(isset($input['menu'])){
            $input['menu'] =  $this->setMenu($input);
        }
        if(isset($input['allowed_email'])){
            $input['allowed_email'] = $input['allowed_email'] ? tagFormat($input['allowed_email']) : 'gmail.com';
        }
        if(isset($input['theme_color'])){
            $input['theme_color'] = str_replace('#','',$input['theme_color']);
        }
        $this->emailConfig($input);
        $gs->update($input);