project/app/Http/Controllers/Admin/AdminController.php

    public function index()
    {

        $data['totalUser']     = User::where('email_verified',1)->count();
        $data['totalCurrency'] = Currency::count();
        $data['totalCountry']  = Country::count();
        $data['totalRole']     = DB::table('roles')->count();
        $data['totalStaff']    = Admin::where('role','!=','super-admin')->count();
        $data['recentUsers']     = User::latest()->take(7)->get();
        $data['totalDeposit'] =   Deposit::with('currency')->sum('default_curr_amount');
        $data['totalWithdraw'] =  Withdrawals::with('currency')->sum('amount');
---
select count(*) as aggregate from `users` where `email_verified` = 1
select count(*) as aggregate from `currencies`
select count(*) as aggregate from `countries`
select count(*) as aggregate from `roles`
select count(*) as aggregate from `admins` where `role` != 'super-admin'
select * from `users` order by `created_at` desc limit 7
select sum(`default_curr_amount`) as aggregate from `deposits`
select sum(`amount`) as aggregate from `withdrawals`