project/app/Http/Controllers/Admin/CampaignSettingController.php

select * from `campaign_settings` limit 1
---
    public function setting()
    {
        $campaign_settings = CampaignSetting::first();