project/app/Http/Controllers/Admin/GiftController.php

    public function index()
    {


        $search = request('search');
        $status = null;
        if(request('status') == 'active')  $status = 1;
        if(request('status') == 'banned')  $status = 2;

        $gift =  Gift::when($status,function($q) use($status) {
            return $q->where('status',$status);
        })->when($search,function($q) use($search) {
            return $q->where('name','like',"%$search%");
        })->latest()->paginate(15);
---
select * from `gifts` order by `created_at` desc limit 15 offset 0
select count(*) as aggregate from `gifts`