project/app/Http/Controllers/Admin/JobCategoryController.php

select * from `job_categories` order by `created_at` desc limit 15 offset 0
select count(*) as aggregate from `job_categories`
---
    public function index()
    {


        $search = request('search');
        $status = null;
        if(request('status') == 'open')  $status = 1;
        if(request('status') == 'close')  $status = 2;

        $job_categories =  JobCategory::when($status,function($q) use($status) {
            return $q->where('status',$status);
        })->when($search,function($q) use($search) {
            return $q->where('name','like',"%$search%");
        })->latest()->paginate(15);