project/app/Http/Controllers/Admin/JobController.php

    public function create()
    {

        $jcategories = JobCategory::all();
---
select * from `job_categories`

    public function edit(Job $job)
    {
        $jcategories = JobCategory::all();
---
select * from `job_categories`