project/app/Http/Controllers/Admin/RewardController.php

select count(*) as aggregate from `rewards`
---
    public function index(){
        $search = request('search');
        $status = null;
        if(request('status') == 'active')  $status = 1;
        if(request('status') == 'banned')  $status = 2;

        $reward =  Reward::when($status,function($q) use($status) {
            return $q->where('status',$status);
        })->when($search,function($q) use($search) {
            return $q->where('name','like',"%$search%");
        })->latest()->paginate(15);