project/app/Http/Controllers/Admin/WithdrawalController.php

    public function accepted()
    {
        $withdrawlogs = Withdrawals::where('status', 1)->latest()->with(['method','user','currency'])->paginate(15);
---
select * from `users` where `users`.`id` in (1)
select * from `withdrawals` where `status` = 1 order by `created_at` desc limit 15 offset 0
select count(*) as aggregate from `withdrawals` where `status` = 1