project/app/Providers/AppServiceProvider.php

select * from `generalsettings` limit 1
select count(*) as aggregate from `withdrawals` where `status` = 0
select count(*) as aggregate from `support_tickets` where `status` = 0 and exists (select * from `ticket_messages` where `support_tickets`.`id` = `ticket_messages`.`ticket_id`)
select count(*) as aggregate from `deposits` where `status` = 'pending'
---
    public function boot()
    {
        Paginator::useBootstrap();

        view()->composer('*',function($settings){
            $settings->with('gs', cache()->remember('generalsettings', now()->addDay(), function () {
                return Generalsetting::first();
            }));

        });

        view()->composer('admin.partials.sidebar', function ($view) {
            $view->with([
                'pending_withdraw'        =>  Withdrawals::whereStatus(0)->count(),
                'pending_user_ticket'     =>  SupportTicket::whereStatus(0)->whereHas('messages')->count(),
                'pending_deposits'        =>  Deposit::where('status','pending')->count(),
            ]);